--Begin msg_checks.lua
--Begin pre_process function
local function pre_process(msg)
-- Begin 'RondoMsgChecks' text checks by @rondoozle
if is_chat_msg(msg) or is_super_group(msg) then
	if msg and not is_momod(msg) and not is_whitelisted(msg.from.id) then --if regular user
	local data = load_data(_config.moderation.data)
	local print_name = user_print_name(msg.from):gsub("â€®", "") -- get rid of rtl in names
	local name_log = print_name:gsub("_", " ") -- name for log
	local to_chat = msg.to.type == 'chat'
	if data[tostring(msg.to.id)] and data[tostring(msg.to.id)]['settings'] then
		settings = data[tostring(msg.to.id)]['settings']
	else
		return
	end
	if settings.lock_arabic then
		lock_arabic = settings.lock_arabic
	else
		lock_arabic = 'no'
	end
    if settings.lock_fwd then
		lock_fwd = settings.lock_fwd
	else
		lock_fwd = 'yes'
	end
	if settings.lock_reply then
		lock_reply = settings.lock_reply
	else
		lock_reply = 'yes'
	end
    if settings.lock_tag then
		lock_tag = settings.lock_tag
	else
		lock_tag = 'no'
	end
	if settings.lock_emoji then
		lock_emoji = settings.lock_emoji
	else
		lock_emoji = 'no'
	end
	if settings.lock_hashtag then
		lock_hashtag = settings.lock_hashtag
	else
		lock_hashtag = 'no'
	end
	if settings.lock_rtl then
		lock_rtl = settings.lock_rtl
	else
		lock_rtl = 'no'
	end
		if settings.lock_tgservice then
		lock_tgservice = settings.lock_tgservice
	else
		lock_tgservice = 'no'
	end
	if settings.lock_link then
		lock_link = settings.lock_link
	else
		lock_link = 'no'
	end
	if settings.lock_member then
		lock_member = settings.lock_member
	else
		lock_member = 'no'
	end
	if settings.lock_spam then
		lock_spam = settings.lock_spam
	else
		lock_spam = 'no'
	end
	if settings.lock_sticker then
		lock_sticker = settings.lock_sticker
	else
		lock_sticker = 'no'
	end
	if settings.lock_contacts then
		lock_contacts = settings.lock_contacts
	else
		lock_contacts = 'no'
	end
	if settings.strict then
		strict = settings.strict
	else
		strict = 'no'
	end
		if msg and not msg.service and is_muted(msg.to.id, 'All: yes') or is_muted_user(msg.to.id, msg.from.id) and not msg.service then
			delete_msg(msg.id, ok_cb, false)
			if to_chat then
			--	kick_user(msg.from.id, msg.to.id)
			end
		end
		if msg.text then -- msg.text checks
			local _nl, ctrl_chars = string.gsub(msg.text, '%c', '')
			 local _nl, real_digits = string.gsub(msg.text, '%d', '')
			if lock_spam == "yes" and string.len(msg.text) > 2049 or ctrl_chars > 40 or real_digits > 2000 then
				delete_msg(msg.id, ok_cb, false)
				if strict == "yes" or to_chat then
					delete_msg(msg.id, ok_cb, false)
					kick_user(msg.from.id, msg.to.id)
				end
			end
			local is_link_msg = msg.text:match("[Tt][Ee][Ll][Ee][Gg][Rr][Aa][Mm].[Mm][Ee]/") or msg.text:match("[Tt][Ll][Gg][Rr][Mm].[Mm][Ee]/")
			local is_bot = msg.text:match("?[Ss][Tt][Aa][Rr][Tt]=")
			if is_link_msg and lock_link == "yes" and not is_bot then
				delete_msg(msg.id, ok_cb, false)
				if strict == "yes" or to_chat then
					kick_user(msg.from.id, msg.to.id)
				end
		end
		local is_emoji_msg = msg.text:match("[ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸âœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸âœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸âœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸âœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈ]")
			if is_emoji_msg and lock_emoji == "yes" then
				delete_msg(msg.id, ok_cb, false)
				if strict == "yes" or to_chat then
					return
				end
		end
		local is_tag_msg = msg.text:match("@")
			if is_tag_msg and lock_tag == "yes" then
				delete_msg(msg.id, ok_cb, false)
				if strict == "yes" or to_chat then
					return
				end
		end
		local is_hashtag_msg = msg.text:match("#")
			if is_hashtag_msg and lock_hashtag == "yes" then
				delete_msg(msg.id, ok_cb, false)
				if strict == "yes" or to_chat then
					return
				end
		end
		if msg.service then 
			if lock_tgservice == "yes" then
				delete_msg(msg.id, ok_cb, false)
				if to_chat then
					return
				end
			end
		end
			local is_squig_msg = msg.text:match("[\216-\219][\128-\191]")
			if is_squig_msg and lock_arabic == "yes" then
				delete_msg(msg.id, ok_cb, false)
				if strict == "yes" or to_chat then
					return
				end
			end
			local print_name = msg.from.print_name
			local is_rtl = print_name:match("â€®") or msg.text:match("â€®")
			if is_rtl and lock_rtl == "yes" then
				delete_msg(msg.id, ok_cb, false)
				if strict == "yes" or to_chat then
					return
				end
			end
			if is_muted(msg.to.id, "Text: yes") and msg.text and not msg.media and not msg.service then
				delete_msg(msg.id, ok_cb, false)
				if to_chat then
					return
				end
			end
		end
		if msg.media then -- msg.media checks
			if msg.media.title then
				local is_link_title = msg.media.title:match("[Tt][Ee][Ll][Ee][Gg][Rr][Aa][Mm].[Mm][Ee]/") or msg.media.title:match("[Tt][Ll][Gg][Rr][Mm].[Mm][Ee]/")
				if is_link_title and lock_link == "yes" then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						kick_user(msg.from.id, msg.to.id)
					end
				end
				local is_tag_title = msg.media.title:match("@")
				if is_tag_title and lock_tag == "yes" then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						return
					end
				end
				local is_emoji_title = msg.media.title:match("[ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸âœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸âœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸âœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸âœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈ]")
				if is_emoji_title and lock_emoji == "yes" then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						return
					end
				end
				local is_hashtag_title = msg.media.title:match("#")
				if is_hashtag_title and lock_hashtag == "yes" then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						return
					end
				end
				local is_squig_title = msg.media.title:match("[\216-\219][\128-\191]")
				if is_squig_title and lock_arabic == "yes" then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						return
					end
				end
			end
			if msg.media.description then
				local is_link_desc = msg.media.description:match("[Tt][Ee][Ll][Ee][Gg][Rr][Aa][Mm].[Mm][Ee]/") or msg.media.description:match("[Tt][Ll][Gg][Rr][Mm].[Mm][Ee]/")
				if is_link_desc and lock_link == "yes" then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						kick_user(msg.from.id, msg.to.id)
					end
				end
				local is_squig_desc = msg.media.description:match("[\216-\219][\128-\191]")
				if is_squig_desc and lock_arabic == "yes" then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						return
					end
				end
			end
			if msg.media.caption then -- msg.media.caption checks
				local is_link_caption = msg.media.caption:match("[Tt][Ee][Ll][Ee][Gg][Rr][Aa][Mm].[Mm][Ee]/") or msg.media.caption:match("[Tt][Ll][Gg][Rr][Mm].[Mm][Ee]/")
				if is_link_caption and lock_link == "yes" then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						kick_user(msg.from.id, msg.to.id)
					end
				end
				local is_squig_caption = msg.media.caption:match("[\216-\219][\128-\191]")
					if is_squig_caption and lock_arabic == "yes" then
						delete_msg(msg.id, ok_cb, false)
						if strict == "yes" or to_chat then
							return
						end
					end
				local is_tag_caption = msg.media.caption:match("@")
				if is_tag_caption and lock_tag == "yes" then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						return
					end
				end
				local is_emoji_caption = msg.media.caption:match("[ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸âœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸âœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸âœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸âœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈ]")
				if is_emoji_caption and lock_emoji == "yes" then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						return
					end
				end
				local is_username_caption = msg.media.caption:match("^@[%a%d]")
				if is_username_caption and lock_link == "yes" then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						return
					end
				end
				if lock_sticker == "yes" and msg.media.caption:match("sticker.webp") then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						--kick_user(msg.from.id, msg.to.id)
					end
				end
			end
			if msg.media.type:match("contact") and lock_contacts == "yes" then
				delete_msg(msg.id, ok_cb, false)
				if strict == "yes" or to_chat then
					--kick_user(msg.from.id, msg.to.id)
				end
			end
			local is_photo_caption =  msg.media.caption and msg.media.caption:match("photo")--".jpg",
			if is_muted(msg.to.id, 'Photo: yes') and msg.media.type:match("photo") or is_photo_caption and not msg.service then
				delete_msg(msg.id, ok_cb, false)
				if strict == "yes" or to_chat then
					--	kick_user(msg.from.id, msg.to.id)
				end
			end
			local is_gif_caption =  msg.media.caption and msg.media.caption:match(".mp4")
			if is_muted(msg.to.id, 'Gifs: yes') and is_gif_caption and msg.media.type:match("document") and not msg.service then
				delete_msg(msg.id, ok_cb, false)
				if to_chat then
					--	kick_user(msg.from.id, msg.to.id)
				end
			end
			if is_muted(msg.to.id, 'Audio: yes') and msg.media.type:match("audio") and not msg.service then
				delete_msg(msg.id, ok_cb, false)
				if to_chat then
					--kick_user(msg.from.id, msg.to.id)
				end
			end
			local is_video_caption = msg.media.caption and msg.media.caption:lower(".mp4","video")
			if  is_muted(msg.to.id, 'Video: yes') and msg.media.type:match("video") and not msg.service then
				delete_msg(msg.id, ok_cb, false)
				if to_chat then
					--kick_user(msg.from.id, msg.to.id)
				end
			end
			if is_muted(msg.to.id, 'Documents: yes') and msg.media.type:match("document") and not msg.service then
				delete_msg(msg.id, ok_cb, false)
				if to_chat then
					--kick_user(msg.from.id, msg.to.id)
				end
			end
		end
		if msg.fwd_from then  --  msg forwarded
			if msg.fwd_from.title then
				local is_link_title = msg.fwd_from.title:match("[Tt][Ee][Ll][Ee][Gg][Rr][Aa][Mm].[Mm][Ee]/") or msg.fwd_from.title:match("[Tt][Ll][Gg][Rr][Mm].[Mm][Ee]/")
				if is_link_title and lock_link == "yes" then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						kick_user(msg.from.id, msg.to.id)
					end
				end
				local is_squig_title = msg.fwd_from.title:match("[\216-\219][\128-\191]")
				if is_squig_title and lock_arabic == "yes" then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						--kick_user(msg.from.id, msg.to.id)
					end
				end
				local is_tag_title = msg.fwd_from.title:match("@")
				if is_tag_title and lock_tag == "yes" then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						--kick_user(msg.from.id, msg.to.id)
					end
				end
				local is_emoji_title = msg.fwd_from.title:match("[ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸âœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸âœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸âœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸ًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹًںک€ًںک¬ًںکپًںک‚ًںکƒًںک„ًںک…ًںک†ًںک‡ًںک‰ًںکٹًں™‚ًں™ƒâک؛ï¸ڈًںکڑًںک™ًںک—ًںککًںکچًںکŒًںک‹ًںکœًںک‌ًںک›ًں¤‘ًں¤“ًںکژًں¤—ًں¤”ًں™„ًںک’ًںک‘ًںکگًںک¶ًںکڈًںک³ًںک‍ًںکںًںک ًںک،ًںک”ًںک•ًںک¤ًںک©ًںک«ًںک–ًںک£âک¹ï¸ڈًں™پًںک®ًںک±ًںک¨ًںک°ًںک¯ًںک¦ًںک§ًںک²ًںکµًںک­ًںک“ًںکھًںک¥ًںک¢ًں¤گًںک·ًں¤’ًں¤•ًںک´ًں’¤ًں’©ًں‘½ًں‘»ًں’€ًں‘؛ًں‘¹ًں‘؟ًںکˆًں¤–ًںک؛ًںک¸ًںک¹ًںک»ًںک¼ًںک½ًں‘چًں‘‹ًں‘ڈًں™Œًںک¾ًںک؟ًں™€ًں‘ژًںڈ»ًں‘ٹâœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸âœٹâœŒًں‘Œâœ‹ًں‘گًں‘‰ًں‘ˆًں‘‡ًں‘†âک‌ï¸ڈًں™ڈًں’ھًں–•ًں–گًں¤کًں––âœچًں’…ًں‘„ًں‘…ًں‘‚ًں‘ƒًں‘پًں‘€ًں‘¤ًں‘¥ًں—£ًں‘¶ًں‘¦ًں‘§ًں‘¨ًں‘©ًں‘±ًں‘´ًں‘µًں‘²ًں‘³ًں‘®ًں‘·ًں’‚ًں•µًںژ…ًں‘¼ًں‘¸ًں‘°ًںڑ¶ًںڈƒًں’ƒًں‘¯ًں‘«ًں‘¬ًں‘­ًں™‡ًں’پًں™…ًں™†ًں™‹ًں™ژًں™چًں’‡ًں’†ًں’‘ًں‘©â€چâ‌¤ï¸ڈâ€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں‘¨ًں’ڈًں‘©â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘©ًں‘¨â€چâ‌¤ï¸ڈâ€چًں’‹â€چًں‘¨ًں‘ھًں‘©â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘©â€چًں‘©â€چًں‘§ًں‘©â€چًں‘©â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘§ًں‘¨â€چًں‘©â€چًں‘¦â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§â€چًں‘¦ًں‘¨â€چًں‘©â€چًں‘§ًں‘ڑًں‘•ًں‘–ًں‘”ًں‘—ًں‘™ًں‘کًں‘‍ًں‘¢ًں‘،ًں‘ ًں‘£ًں’‹ًں’„ًں‘ںًں‘’ًںژ©ًںژ“ًں‘‘â›‘ًںژ’ًں’چًں•¶ًں‘“ًں’¼ًں‘œًں‘›ًں‘‌ًںŒ‚ًںگ¶ًںگ±ًںگ­ًںگ¹ًںگ°ًںگ»ًںگ¼ًںگ¸ًںگ½ًںگ·ًںگ®ًں¦پًںگ¯ًںگ¨ًںگ™ًںگµًں™ˆًں™‰ًں™ٹًںگ’ًںگ”ًںگ—ًںگ؛ًںگ¥ًںگ£ًںگ¤ًںگ¦ًںگ§ًںگ´ًں¦„ًںگ‌ًںگ›ًںگŒًںگ‍ًںگœًںگںًںگ ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈًں”؛ًں”·ًں”¶ًں”¹ًں”¸ًںگ¢ًںگچًں¦€ًں¦‚ًں•·ًںگ،ًںگ¬ًںگ³ًںگ‹ًںگٹًںگ†ًںگ…ًںچ€âککًںŒ¾ًںچپًںچ‚ًںچƒًںŒ·ًںŒ¼ًںŒ¸ًں’گًںŒ؛ًںچ„ًںŒ»ًںŒ°ًںŒ¹ًںژƒًںŒ”ًںŒڑًںŒ–ًںŒ•ًںŒ“ًںŒڈًںŒچًںŒژًںŒ‘ًںŒکًںŒ—ًںŒ’ًںŒœًںŒ›ًںŒ‌ًںŒ™ًں’¦ًں’¥ًںژ¤ًںژ®ًںڈ‹ًں”Œًں’،ًں“‍ًں“·ًں“¸âڑ™ًں”§ًں”«âک ًں“ژًں”—ًں“چًںڑ©â‌¤ï¸ڈًں’›ًں’ڑًں’™ًں’œًں’”â‌£ًں’‌ًں’کًں’–ًں’—ًں’“ًں’‍ًں’•ًں’ںًں”°âœ…â‌ژâœ³ï¸ڈâ‌‡ï¸ڈًں’¹â‍؟ًںŒگâ“‚ï¸ڈًںڈ§ًںˆ‚ًں›‚ًں’ â™»ï¸ڈًں”°ًں”…ًں”†ًں”±ًں’¯âڑœâ¬‡ï¸ڈâ¬†ï¸ڈâ¬…ï¸ڈâ‍،ï¸ڈâ†—ï¸ڈâ†کï¸ڈâڈھًں”½ًں”¼â—€ï¸ڈâڈ©âڈھâ–¶ï¸ڈًں†•ًں†—ًں†–ًں†™â‍–â‍•م€°ًںژ¶â‍°âœ”ï¸ڈًںژµًں”کâک‘ï¸ڈًں”œًں”ڑâڑھï¸ڈ]")
				if is_emoji_title and lock_emoji == "yes" then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						--kick_user(msg.from.id, msg.to.id)
					end
				end
				local is_hashtag_title = msg.fwd_from.title:match("#")
				if is_hashtag_title and lock_hashtag == "yes" then
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						--kick_user(msg.from.id, msg.to.id)
					end
				end
			end
			if is_muted_user(msg.to.id, msg.fwd_from.peer_id) then
				delete_msg(msg.id, ok_cb, false)
			end
		end
		    if msg.fwd_from then
                     if lock_fwd == "yes" then
                     delete_msg(msg.id, ok_cb, false)
               if strict == "yes" then
                     --kick_user(msg.from.id, msg.to.id)
                     end
                  end
               end
			   if msg.reply_id then
                     if lock_reply == "yes" then
                     delete_msg(msg.id, ok_cb, false)
               if strict == "yes" then
                     --kick_user(msg.from.id, msg.to.id)
                     end
                  end
               end

		if msg.service then -- msg.service checks
		local action = msg.action.type
			if action == 'chat_add_user_link' then
				local user_id = msg.from.id
				local _nl, ctrl_chars = string.gsub(msg.text, '%c', '')
				if string.len(msg.from.print_name) > 70 or ctrl_chars > 40 and lock_group_spam == 'yes' then
					savelog(msg.to.id, name_log.." ["..msg.from.id.."] joined and Service Msg deleted (#spam name)")
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						savelog(msg.to.id, name_log.." ["..msg.from.id.."] joined and kicked (#spam name)")
						--kick_user(msg.from.id, msg.to.id)
					end
				end
				local print_name = msg.from.print_name
				local is_rtl_name = print_name:match("â€®")
				if is_rtl_name and lock_rtl == "yes" then
					savelog(msg.to.id, name_log.." User ["..msg.from.id.."] joined and kicked (#RTL char in name)")
					--kick_user(user_id, msg.to.id)
				end
				if lock_member == 'yes' then
					savelog(msg.to.id, name_log.." User ["..msg.from.id.."] joined and kicked (#lockmember)")
					kick_user(user_id, msg.to.id)
					delete_msg(msg.id, ok_cb, false)
				end
			end
			if action == 'chat_add_user' and not is_momod2(msg.from.id, msg.to.id) then
				local user_id = msg.action.user.id
				if string.len(msg.action.user.print_name) > 70 and lock_group_spam == 'yes' then
					savelog(msg.to.id, name_log.." ["..msg.from.id.."] added ["..user_id.."]: Service Msg deleted (#spam name)")
					delete_msg(msg.id, ok_cb, false)
					if strict == "yes" or to_chat then
						savelog(msg.to.id, name_log.." ["..msg.from.id.."] added ["..user_id.."]: added user kicked (#spam name) ")
						delete_msg(msg.id, ok_cb, false)
						kick_user(msg.from.id, msg.to.id)
					end
				end
				local print_name = msg.action.user.print_name
				local is_rtl_name = print_name:match("â€®")
				if is_rtl_name and lock_rtl == "yes" then
					savelog(msg.to.id, name_log.." User ["..msg.from.id.."] added ["..user_id.."]: added user kicked (#RTL char in name)")
					kick_user(user_id, msg.to.id)
				end
				if msg.to.type == 'channel' and lock_member == 'yes' then
					savelog(msg.to.id, name_log.." User ["..msg.from.id.."] added ["..user_id.."]: added user kicked  (#lockmember)")
					kick_user(user_id, msg.to.id)
					delete_msg(msg.id, ok_cb, false)
				end
			end
		end
	end
end
-- End 'RondoMsgChecks' text checks by @Rondoozle
	return msg
end
--End pre_process function
return {
	patterns = {},
	pre_process = pre_process
}
--End msg_checks.lua
--By @Rondoozle
